HELYXcore-4.4.0/modules/swak4Foam/Examples/SimpleSurface/littleVolcano/0.org/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    volcano_inlet
    {
        type            zeroGradient;
    }

    sky
    {
        type            fixedValue;
        value           uniform 0;
    }

    outside
    {
        $sky;
    }

    volcano_wall
    {
        type            fixedFluxPressure;
        adjoint         no;
    }

    "land.*"
    {
        $volcano_wall;
    }

    sea
    {
        type zeroGradient;
    }
}


// ************************************************************************* //
