HELYXcore-4.4.0/modules/swak4Foam/Examples/SimpleSurface/littleVolcano/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    sea
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1197;
        startFace       360356;
    }
    outside
    {
        type            patch;
        nFaces          4394;
        startFace       361553;
    }
    sky
    {
        type            patch;
        nFaces          3600;
        startFace       365947;
    }
    volcano_wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          5175;
        startFace       369547;
    }
    volcano_inlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          55;
        startFace       374722;
    }
    land
    {
        type            wall;
        inGroups        1(wall);
        nFaces          11517;
        startFace       374777;
    }
)

// ************************************************************************* //
